app/views/items/edit.html.erb

SELECT "categories".* FROM "categories"
---

                  <%= f.collection_select(:category_id, Category.all, :id, :nombre, {:prompt => "Seleccione..."},{:class => 'form-control'}) %>

SELECT "marcas".* FROM "marcas" WHERE (category_id = 1)
---

                  <%= f.collection_select(:marca_id, Marca.where("category_id = ?", f.object.category_id), :id, :nombre, {:prompt => "Seleccione..."},{:class => 'form-control'}) %>

SELECT "modelos".* FROM "modelos" WHERE (marca_id = 0)
---
                  <label>Modelo</label>
                    <%= f.collection_select(:modelo_id, Modelo.where("marca_id = ?", f.object.marca_id), :id, :nombre, {:prompt => "Seleccione..."},{:class => 'form-control'}) %>