app/views/items/index.html.erb

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "marcas".* FROM "marcas" WHERE "marcas"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "modelos".* FROM "modelos" WHERE "modelos"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
---
                      <!-- <td><%= item.id %></td> -->
                      <td><%= Category.find(item.category_id).nombre %></td>
                      <td><%= Marca.find(item.marca_id).nombre %></td>
                      <td><%= Modelo.find(item.modelo_id).nombre %></td>

SELECT  "mantenimientos".* FROM "mantenimientos" WHERE (item_id = 9) ORDER BY "mantenimientos"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
                      <td><% if item.tiene_mantenimiento === 'Si' %>
                        <% mant = Mantenimiento.where('item_id = ?',item.id).first%>