app/views/items/new.html.erb

                <!--  <%= f.select(:category, [["Refrigerador/Congelador","Refrigerador/Congelador"], ["Termo","Termo"], ["Caja","Caja"], ["Aire acondicionado","Aire"], ["Termometro","Termometro"]], {}, { :class => 'form-control' })%> -->
                  <%= f.collection_select(:category, Category.all, :id, :nombre, :prompt => "Seleccione...") %>
---
SELECT "categories".* FROM "categories"