app/controllers/items_controller.rb

SELECT "items".* FROM "items" WHERE (institucion_id = 1)
---
  def index
    @items = Item.where('institucion_id = ?',current_user.institucion_id)

SELECT "categories".* FROM "categories"
---
  def new
    @categorias = Category.all

INSERT INTO "items" ("created_at", "updated_at", "serial", "num_manten_year", "regulador", "monitoreo", "volumen", "num_paquetes", "institucion_id", "potencia", "cargador_bateria", "transfer_automatica", "capacidad_refrigeracion", "dimensiones", "funciona", "compresor", "num_compresores", "category_id", "marca_id", "modelo_id", "tiene_mantenimiento", "marca_digitada", "modelo_digitado") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23) RETURNING "id"
INSERT INTO "mantenimientos" ("created_at", "updated_at", "item_id") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", 2018-01-16 18:53:23 UTC], ["updated_at", 2018-01-16 18:53:23 UTC], ["item_id", 11]]
---
  def create
    params[:item][:remaining_quantity] = params[:item][:quantity]
    @item = Item.new(item_params)
    @item.institucion_id = current_user.institucion_id
    if @item.save
    #  if @item.mantenimiento === 'Si'
        @mantenimiento = Mantenimiento.new
        @mantenimiento.item_id = @item.id
        @mantenimiento.save

UPDATE "items" SET "marca" = $1, "modelo" = $2, "serial" = $3, "updated_at" = $4 WHERE "items"."id" = $5  [["marca", "VESTFROST"], ["modelo", "MK304"], ["serial", "20076683271"], ["updated_at", 2017-12-21 00:35:04 UTC], ["id", 1]]
---
  def update
    if @item.update(item_params)

SELECT "marcas".* FROM "marcas" WHERE (category_id = '1')
---
  def getMarcas
    #[["Refrigerador/Congelador","Refrigerador/Congelador"], ["Termo","Termo"], ["Caja","Caja"], ["Aire acondicionado","Aire"], ["Termometro","Termometro"]]
    puts params[:categoria]
    @marcas = Marca.where(['category_id = ?',params[:categoria]])

SELECT "modelos".* FROM "modelos" WHERE (category_id = '1' and marca_id = '142')
---
  def getModelos
    @modelos = Modelo.where('category_id = ? and marca_id = ?', params[:categoria], params[:marca])