app/controllers/orders_controller.rb

  def index
    @orders = Order.all
    @members = Member.all
---
SELECT "orders".* FROM "orders"
SELECT "members".* FROM "members"