app/views/layouts/_header.html.erb

SELECT  "institucions".* FROM "institucions" WHERE "institucions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
      <span class="sr-only">Toggle navigation</span>
      <%= Institucion.find(current_user.institucion_id).name%>